Practicas/PracticasGretl/pub/Lecc11.tex
% Created 2023-11-02 jue 20:46
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish, ]{babel}
\usepackage[margin=0.5in]{geometry}
\usepackage[svgnames,x11names]{xcolor}
\hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
\PassOptionsToPackage{hyphens}{url}
\usepackage{nacal}
\usepackage{framed}
\usepackage{listings}
\input{hansl.tex}
\lstnewenvironment{hansl-gretl}
{\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
{}
\newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
\lstset{backgroundcolor=\color{lightgray!20}, }
\author{Marcos Bujosa}
\date{\today}
\title{Lección 11}
\begin{document}

\maketitle
\tableofcontents

\clearpage

\section{Diferencias salariales entre hombres y mujeres}
\label{sec:org1479d1f}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/RamanathanPp7-1.inp}{RamanathanPp7-1.inp}\\[0pt]
\end{tabular}
\end{center}

\vspace{10pt}
\noindent
\textbf{Código completo de la práctica}
\vspace{10pt}
\lstinputlisting{scripts/RamanathanPp7-1.inp}
\clearpage


\section{Diferencias salariales entre hombres y mujeres (II)}
\label{sec:org1fcba8c}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/RamanathanEX7-1.inp}{RamanathanEX7-1.inp}\\[0pt]
\end{tabular}
\end{center}

\vspace{10pt}
\noindent
\textbf{Código completo de la práctica}
\vspace{10pt}
\lstinputlisting{scripts/RamanathanEX7-1.inp}
\clearpage


\section{Cambio estructural en la participación de las mujeres en el mercado laboral}
\label{sec:orgd2a89be}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/RamanathanPS7-6.inp}{RamanathanPS7-6.inp}\\[0pt]
\end{tabular}
\end{center}

\vspace{10pt}
\noindent
\textbf{Código completo de la práctica}
\vspace{10pt}
\lstinputlisting{scripts/RamanathanPS7-6.inp}
\clearpage


\section{Modelo Log-lin con variables ficticias: diferencias salariales entre grupos}
\label{sec:org8817b78}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/wage1dummiesB.inp}{wage1dummiesB.inp}\\[0pt]
\end{tabular}
\end{center}

\vspace{10pt}
\noindent
\textbf{Código completo de la práctica}
\vspace{10pt}
\lstinputlisting{scripts/wage1dummiesB.inp}
\clearpage



\section{Precio de viviendas unifamiliares}
\label{sec:org4570bf5}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/RamanathanEX7-2.inp}{RamanathanEX7-2.inp}\\[0pt]
\end{tabular}
\end{center}

\vspace{10pt}
\noindent
\textbf{Código completo de la práctica}
\vspace{10pt}
\lstinputlisting{scripts/RamanathanEX7-2.inp}
\clearpage
\end{document}